frontend/controllers/VoteController.php

SELECT * FROM `category`
---
	public function actionIndex(){
		$data = VoteCategory::find()->asArray()->all();