learn/controllers/VoteController.php

SELECT * FROM `vote` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Vote::findOne($id)) !== null) {